---
kind: type
id: T:Autodesk.Revit.DB.ISaveSharedCoordinatesCallback
source: html/ed4eac2a-d482-7760-2ae7-855611d09c46.htm
---
# Autodesk.Revit.DB.ISaveSharedCoordinatesCallback

An interface that may be used to control Revit when trying to unload
 or reload a Revit link with changes in shared coordinates.

## Syntax (C#)
```csharp
public interface ISaveSharedCoordinatesCallback
```